In [1]:
import pandas as pd
import numpy as np

In [2]:
moon_df = pd.read_csv('Resources/full_moon.csv')
birth_df = pd.read_csv('Resources/US_births_2000-2014_SSA.csv')

In [3]:
# Dropping data
## Drop time column from moon_df
## Drop some of the overlap rows (iloc? or sql?) (.drop(year==2000,...,2003))

# Transform data
## Set 'Date' in moon_df to the same format as the other dataframes for merging later
## Does 'Day' column in moon_df need to be encoded to numbers?

# Merge data
## Merge the two birth_df dataframes. Same columns so just add it together

# For ML section
## Merge in the moon_df dataframe. Add in a column indicating that those rows have full-moon, then fill in the rest as not-full-moon?

In [4]:
moon_df.head()

         Day               Date          Time
0     Monday    15 January 1900   08:07:30 pm
1  Wednesday   14 February 1900   02:50:12 pm
2     Friday      16 March 1900   09:11:48 am
3     Sunday      15 April 1900   02:02:06 am
4     Monday        14 May 1900   04:36:36 pm

In [5]:
moon_df.columns

Index(['Day', 'Date', 'Time'], dtype='object')

In [6]:
moon_df.drop("Time",axis=1,inplace=True)

In [7]:
moon_df.head()

         Day               Date
0     Monday    15 January 1900
1  Wednesday   14 February 1900
2     Friday      16 March 1900
3     Sunday      15 April 1900
4     Monday        14 May 1900

In [8]:
birth_df.head()

     year  month  date_of_month  day_of_week   births      date
0  2000.0    1.0            1.0          6.0   9083.0  1/1/2000
1  2000.0    1.0            2.0          7.0   8006.0  1/2/2000
2  2000.0    1.0            3.0          1.0  11363.0  1/3/2000
3  2000.0    1.0            4.0          2.0  13032.0  1/4/2000
4  2000.0    1.0            5.0          3.0  12558.0  1/5/2000

In [9]:
moon_df[['A', 'b', 'C']] = moon_df['Date'].str.split(expand=True)

In [10]:
moon_df['C'] = moon_df['C'].astype(int)

In [11]:
moon_df['A'] = moon_df['A'].astype(int)

In [12]:
moon_df.dtypes

Day     object
Date    object
A        int32
b       object
C        int32
dtype: object

In [13]:
moon_df.drop(moon_df[moon_df['C']<2000].index, inplace=True)

moon_df.drop(moon_df[moon_df['C']>2014].index, inplace=True)

# df.drop(df[df['Fee'] >= 24000].index, inplace = True)

In [14]:
moon_df.head()

           Day               Date   A         b     C
1237    Friday    21 January 2000  21   January  2000
1238  Saturday   19 February 2000  19  February  2000
1239    Monday      20 March 2000  20     March  2000
1240   Tuesday      18 April 2000  18     April  2000
1241  Thursday        18 May 2000  18       May  2000

In [15]:
moon_df.tail()

            Day               Date   A          b     C
1417     Sunday     10 August 2014  10     August  2014
1418    Tuesday   9 September 2014   9  September  2014
1419  Wednesday     8 October 2014   8    October  2014
1420   Thursday    6 November 2014   6   November  2014
1421   Saturday    6 December 2014   6   December  2014

In [16]:
moon_df['Date'] = pd.to_datetime(moon_df['Date'])

In [17]:
moon_df['Full Moon'] = 'True'

In [18]:
moon_df.head()

           Day       Date   A         b     C Full Moon
1237    Friday 2000-01-21  21   January  2000      True
1238  Saturday 2000-02-19  19  February  2000      True
1239    Monday 2000-03-20  20     March  2000      True
1240   Tuesday 2000-04-18  18     April  2000      True
1241  Thursday 2000-05-18  18       May  2000      True

In [19]:
birth_df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

        year  month  date_of_month  day_of_week   births        date
0     2000.0    1.0            1.0          6.0   9083.0    1/1/2000
1     2000.0    1.0            2.0          7.0   8006.0    1/2/2000
2     2000.0    1.0            3.0          1.0  11363.0    1/3/2000
3     2000.0    1.0            4.0          2.0  13032.0    1/4/2000
4     2000.0    1.0            5.0          3.0  12558.0    1/5/2000
...      ...    ...            ...          ...      ...         ...
5474  2014.0   12.0           27.0          6.0   8656.0  12/27/2014
5475  2014.0   12.0           28.0          7.0   7724.0  12/28/2014
5476  2014.0   12.0           29.0          1.0  12811.0  12/29/2014
5477  2014.0   12.0           30.0          2.0  13634.0  12/30/2014
5478  2014.0   12.0           31.0          3.0  11990.0  12/31/2014

[5479 rows x 6 columns]

In [20]:
birth_df['date'] = pd.to_datetime(birth_df['date'])
birth_df.head()

     year  month  date_of_month  day_of_week   births       date
0  2000.0    1.0            1.0          6.0   9083.0 2000-01-01
1  2000.0    1.0            2.0          7.0   8006.0 2000-01-02
2  2000.0    1.0            3.0          1.0  11363.0 2000-01-03
3  2000.0    1.0            4.0          2.0  13032.0 2000-01-04
4  2000.0    1.0            5.0          3.0  12558.0 2000-01-05

In [21]:
df = pd.merge(birth_df,moon_df, how='left',left_on='date', right_on=moon_df['Date'])

In [22]:
df.head(21)

,year,month,date_of_month,day_of_week,births,date,Day,Date,A,b,C,Full Moon
0,2000.0,1.0,1.0,6.0,9083.0,2000-01-01,NaN,NaT,NaN,NaN,NaN,NaN
1,2000.0,1.0,2.0,7.0,8006.0,2000-01-02,NaN,NaT,NaN,NaN,NaN,NaN
2,2000.0,1.0,3.0,1.0,11363.0,2000-01-03,NaN,NaT,NaN,NaN,NaN,NaN
3,2000.0,1.0,4.0,2.0,13032.0,2000-01-04,NaN,NaT,NaN,NaN,NaN,NaN
4,2000.0,1.0,5.0,3.0,12558.0,2000-01-05,NaN,NaT,NaN,NaN,NaN,NaN
5,2000.0,1.0,6.0,4.0,12466.0,2000-01-06,NaN,NaT,NaN,NaN,NaN,NaN
6,2000.0,1.0,7.0,5.0,12516.0,2000-01-07,NaN,NaT,NaN,NaN,NaN,NaN
7,2000.0,1.0,8.0,6.0,8934.0,2000-01-08,NaN,NaT,NaN,NaN,NaN,NaN
8,2000.0,1.0,9.0,7.0,7949.0,2000-01-09,NaN,NaT,NaN,NaN,NaN,NaN
9,2000.0,1.0,10.0,1.0,11668.0,2000-01-10,NaN,NaT,NaN,NaN,NaN,NaN
10,2000.0,1.0,11.0,2.0,12611.0,2000-01-11,NaN,NaT,NaN,NaN,NaN,NaN
11,2000.0,1.0,12.0,3.0,12398.0,2000-01-12,NaN,NaT,NaN,NaN,NaN,NaN
12,2000.0,1.0,13.0,4.0,11815.0,2000-01-13,NaN,NaT,NaN,NaN,NaN,NaN
13,2000.0,1.0,14.0,5.0,12180.0,2000-01-14,NaN,NaT,NaN,NaN,NaN,NaN
14,2000.0,1.0,15.0,6.0,8525.0,2000-01-15,NaN,NaT,NaN,NaN,NaN,NaN
15,2000.0,1.0,16.0,7.0,7657.0,2000-01-16,NaN,NaT,NaN,NaN,NaN,NaN
16,2000.0,1.0,17.0,1.0,10824.0,2000-01-17,NaN,NaT,NaN,NaN,NaN,NaN
17,2000.0,1.0,18.0,2.0,12350.0,2000-01-18,NaN,NaT,NaN,NaN,NaN,NaN
18,2000.0,1.0,19.0,3.0,12405.0,2000-01-19,NaN,NaT,NaN,NaN,NaN,NaN
19,2000.0,1.0,20.0,4.0,12506.0,2000-01-20,NaN,NaT,NaN,NaN,NaN,NaN
20,2000.0,1.0,21.0,5.0,11953.0,2000-01-21,Friday,2000-01-21,21.0,January,2000.0,True

In [23]:
df.drop(['Day','Date','date','A','b','C'], axis=1, inplace=True)

df.head(21)

      year  month  date_of_month  day_of_week   births Full Moon
0   2000.0    1.0            1.0          6.0   9083.0       NaN
1   2000.0    1.0            2.0          7.0   8006.0       NaN
2   2000.0    1.0            3.0          1.0  11363.0       NaN
3   2000.0    1.0            4.0          2.0  13032.0       NaN
4   2000.0    1.0            5.0          3.0  12558.0       NaN
5   2000.0    1.0            6.0          4.0  12466.0       NaN
6   2000.0    1.0            7.0          5.0  12516.0       NaN
7   2000.0    1.0            8.0          6.0   8934.0       NaN
8   2000.0    1.0            9.0          7.0   7949.0       NaN
9   2000.0    1.0           10.0          1.0  11668.0       NaN
10  2000.0    1.0           11.0          2.0  12611.0       NaN
11  2000.0    1.0           12.0          3.0  12398.0       NaN
12  2000.0    1.0           13.0          4.0  11815.0       NaN
13  2000.0    1.0           14.0          5.0  12180.0       NaN
14  2000.0    1.0           15.0          6.0   8525.0       NaN
15  2000.0    1.0           16.0          7.0   7657.0       NaN
16  2000.0    1.0           17.0          1.0  10824.0       NaN
17  2000.0    1.0           18.0          2.0  12350.0       NaN
18  2000.0    1.0           19.0          3.0  12405.0       NaN
19  2000.0    1.0           20.0          4.0  12506.0       NaN
20  2000.0    1.0           21.0          5.0  11953.0      True

In [24]:
df.fillna(value='False', inplace=True)

df.head(21)

      year month date_of_month day_of_week   births Full Moon
0   2000.0   1.0           1.0         6.0   9083.0     False
1   2000.0   1.0           2.0         7.0   8006.0     False
2   2000.0   1.0           3.0         1.0  11363.0     False
3   2000.0   1.0           4.0         2.0  13032.0     False
4   2000.0   1.0           5.0         3.0  12558.0     False
5   2000.0   1.0           6.0         4.0  12466.0     False
6   2000.0   1.0           7.0         5.0  12516.0     False
7   2000.0   1.0           8.0         6.0   8934.0     False
8   2000.0   1.0           9.0         7.0   7949.0     False
9   2000.0   1.0          10.0         1.0  11668.0     False
10  2000.0   1.0          11.0         2.0  12611.0     False
11  2000.0   1.0          12.0         3.0  12398.0     False
12  2000.0   1.0          13.0         4.0  11815.0     False
13  2000.0   1.0          14.0         5.0  12180.0     False
14  2000.0   1.0          15.0         6.0   8525.0     False
15  2000.0   1.0          16.0         7.0   7657.0     False
16  2000.0   1.0          17.0         1.0  10824.0     False
17  2000.0   1.0          18.0         2.0  12350.0     False
18  2000.0   1.0          19.0         3.0  12405.0     False
19  2000.0   1.0          20.0         4.0  12506.0     False
20  2000.0   1.0          21.0         5.0  11953.0      True